questions_test1 = [
    "1. Введите решение одним словом",
    "2. Введите решение одним словом",
    "3. Введите решение одним словом",
    "4. Введите решение одним словом",
    "5. Введите слова по порядку через запятую\nРазгадайте кроссворд\nГоризонталь\n1. Деятельность, направленная на выработку и систематизацию объективных знаний о действительности\n3. Образовательный центр, созданный для поддержки талантливой молодежи в России\nВертикаль\n2. Ключевое событие Десятилетия науки и технологий, объявленного Указом Президента Российской Федерации в целях усиления роли науки",
    "6. Какой год был объявлен годом науки и технологий?\nВарианты ответа\n1 - 2020 год\n2 - 2018 год\n3 - 2023 год\n4 - 2021 год",
    "7. Талисманом десятилетия науки является\nВарианты ответа\n1 - кот\n2 - рыба\n3 - собака\n4 - обезьяна",
    "8. Отметьте, какой инициативы Десятилетия науки и технологий не существует\nВарианты ответа\n1 - наука рядом\n2 - научно-популярный туризм\n3 - наука как искусство\n4 - научные разработки",
    "9. Сколько идей поступило на конкурс выбора Талисмана Десятилетия науки и технологий?\nВарианты ответа\n1 - 1494\n2 - 1520\n3 - 1555\n4 - 890",
    "10. Какой официальный сайт Десятилетия науки и технологий?\nВарианты ответа\n1 - наука.рф\n2 - Science_id\n3 - Наука и инновации\n4 - ФИПС",
    "11. Назовите место проведения ежегодного Конгресса молодых ученых\nВарианты ответа\n1 - Москва\n2 - Федеральная территория Сириус\n3 - город выбирают каждый год\n4 - Санкт-Петербург",
    "12. Последовательность этапов научного исследования:\nА. Анализ и интерпретация полученных данных\nБ. Планирование исследования\nВ. Формулирование выводов\nГ. Проведение исследования по намеченному плану\nПример для ввода: А, Б, В, Г\nВарианты ответа\n1 - А, Б, В, Г\n2 - Г, Б, А, В\n3 - Б, Г, А, В\n4 - А, Б, Г, В",
    "13. Кем была объявлена инициатива о Десятилетии науки и технологий в России?\nВарианты ответа\n1 - Президентом Российской Федерации\n2 - Советом Федерации\n3 - Министерством науки и высшего образования\n4 - Российским академическим обществом",
    "14. Какая инициатива реализуется в рамках задачи №3 «Повышение доступности информации о достижениях и перспективах российской науки для граждан РФ»?\nВарианты ответа\n1 - Научно-популярный туризм\n2 - Третий семестр\n3 - Научное волонтерство\n4 - Наука побеждает",
    "15. Какая из этих инициатив является частью Десятилетия науки и технологий?\nВарианты ответа\n1 - Программа «Научные кадры»\n2 - Проект «Умный город»\n3 - Инициатива «Передовые технологии в медицине»\n4 - Инициатива «Конгресс молодых ученых и мероприятия-спутники Конгресса»",
    "16. Какие меры предполагается внедрить для достижения целей Десятилетия науки и технологий?\nВарианты ответа\n1 - Увеличение числа научных публикаций\n2 - Создание новых лабораторий и исследовательских центров\n3 - Улучшение условий труда для ученых\n4 - Все вышеперечисленное",
    "17. Координационный совет по делам молодёжи в научной и образовательной сферах Совета при Президенте Российской Федерации по науке и образованию - это:\nВарианты ответа\n1 - Высший руководящий орган системы управления\n2 - Совещательное и координирующее объединение\n3 - Консультативный орган\n4 - Все вышеперечисленные",
    "18. Какой подход подчеркивается в рамках Десятилетия науки и технологий?\nВарианты ответа\n1 - изоляция от международных научных сообществ\n2 - повышение   роли науки в улучшении качества жизни граждан\n3 - сокращение научных инвестиций\n4 - сосредоточение на традиционных отраслях науки",
    "19. В каком из перечисленных направлений науки акцентируется внимание в рамках десятилетия науки и технологий?\nВарианты ответа\n1 - история\n2 - физическая культура\n3 - нанотехнологии\n4 - социология",
    "20. Какая инициатива Десятилетия науки и технологий стремится сократить дистанцию между обществом и научной сферой?\nВарианты ответа\n1 - научно-популярный туризм\n2 - наука рядом\n3 - научное волонтерство\n4 - наука побеждать"

]

photo_id_test1 = [
    "AgACAgIAAxkBAAMaaEsZ5d05RIh_3UMkecU985PVWDUAAk72MRsyHFlKJJ_deo-_X1YBAAMCAAN4AAM2BA",
    "AgACAgIAAxkBAAMeaEsaRGKsUm7H8DweLULCmllgihYAAnv2MRsyHFlK6Xv9Q5IylusBAAMCAAN4AAM2BA",
    "AgACAgIAAxkBAAMhaEsaXetabSflFP0iEYqnW3wnhwUAApvzMRtas1lKMC_tYOJcC0YBAAMCAAN4AAM2BA",
    "AgACAgIAAxkBAAMjaEsabMljYn8_qxxVQGPoZALjz7IAAn32MRsyHFlKabRizonS6_UBAAMCAAN4AAM2BA",
    "AgACAgIAAxkBAAMlaEsakZyc9xd93WmYYN7kzHg7RiUAAn_2MRsyHFlKiNHiszdYHvoBAAMCAAN5AAM2BA"
]
photo_id_test2 = ["AgACAgIAAxkBAAMnaEsatTtFqc56kuJbT-Pu7hc6dZ0AAoH2MRsyHFlKWNXvpm8AAebvAQADAgADeAADNgQ"]
questions_test2 = [
    "Горизонталь\n1. Консультативный орган Совета при Президенте Российской Федерации по науке и образованию, образованный в целях обеспечения взаимодействия Совета по науке и образованию с общественными молодежными объединениями и организациями при рассмотрении вопросов, связанных с развитием науки и образования\n2. Тематические социально - значимые направления, которые могут включать в себя несколько проектов, объединенных общей идеей или целью\n3. Широкий круг деятельности, включая традиционные формы взаимопомощи и самопомощи, сбора средств, официальное предоставление услуг и другие формы гражданского участия, которая осуществляется добровольно на благо широкой общественности без денежного вознаграждения\n\nВводить нужно через запятую по порядку",
    "Привлечение добровольцев к деятельности, которая важна для проведения научных исследований – это?\nВарианты ответа\n1 - Научное волонтерство\n2 - Научное познание\n3 - Научное открытие\n4 - Научный квиз",
    "Какая инициатива Десятилетия науки и технологий стремится сократить дистанцию между обществом и научной сферой?\nВарианты ответа\n1 - научно-популярный туризм\n2 - наука рядом\n3 - научное волонтерство\n4 - наука побеждать",
    "Всероссийский конкурс проектных и исследовательских работ учащихся «горизонты открытий» в рамках инициативы Десятилетия науки и технологий наука побеждать проходит при поддержке?\nВарианты ответа\n1 - Московского государственного университета имени М.В. Ломоносова\n2 - НКО «Фонд развития Физтех-школ»\n3 - ФГБОУ ВО «Донской государственный технический университет»\n4 - Национальный исследовательский университет 'Высшая школа экономики'",
    "АО «Объединенная двигателестроительная корпорация», АО «Объединенная химическая компания «Уралхим», фонд «Сколково», Госкорпорации «Роскосмос» и «Росатом» в рамках Десятилетия науки и технологий реализуют?\nВарианты ответа\n1 - Тематические инициативы по приоритетам научно-технологического развития Российской Федерации\n2 - Инициативу работа с опытом и проектирование будущего\n3 - Инициативу научное волонтерство\n4 - не принимают участие в инициативах Десятилетия науки и технологий",
    "Назовите место проведения ежегодного Конгресса молодых ученых?\nВарианты ответа\n1 - Москва\n2 - Федеральная территория Сириус\n3 - город выбирают каждый год\n4 - Санкт-Петербург",
    "Сколько выделено задач Десятилетия науки и технологий?\nВарианты ответа\n1 - пять\n2 - десять\n3 - три\n4 - восемь",
    "Десятилетие науки и технологий в России включает в себя комплекс?\nВарианты ответа\n1 - инициатив, мероприятий и проектов\n2 - задач и проектов\n3 - инициатив и проектов\n4 - мероприятий",
    "Координационный совет по делам молодежи в научной и образовательной сферах является?\nВарианты ответа\n1 - консультативным органом\n2 - образовательным органом\n3 - молодежной организацией\n4 - регулирующим органом",
    "Когда прошел первый Научный диктант «Наука во имя Победы»?\nВарианты ответа\n1 - 8 февраля 2022 г.\n2 - 7 февраля 2021 г.\n3 - 8 февраля 2024 г.\n4 - 8 февраля 2025 г.",
    "Как называется народный каталог научного оборудования и расходных материалов?\nВарианты ответа\n1 - Наша Лаба\n2 - Каталог открытий\n3 - Зацени\n4 - Проект",
    "IV Конгресс молодых ученых – ключевое событие 2024 года в рамках Десятилетия науки собрало более участников?\nВарианты ответа\n1 - 7000\n2 - 5000\n3 - 5500\n4 - 8000",
    "Национальная премия в области будущих технологий называется?\nВарианты ответа\n1 - Прорыв\n2 - Награда\n3 - Ученый\n4 - Вызов",
    "Президент России Владимир Путин объявил 2022-2031 гг.:\nВарианты ответа\n1 - Десятилетием науки и технологий\n2 - Десятилетием воинской славы\n3 - Десятилетием детства\n4 - Десятилетие педагога и наставника",
    "Научное предположение, основанное на наблюдениях, которое подлежит проверке и экспериментальному подтверждению – это?\nВарианты ответа\n1 - Гипотеза\n2 - Научная новизна\n3 - Объект исследования\n4 - Цель",
    "Последовательность этапов научного исследования:\nА. Анализ и интерпретация полученных данных\nБ. Планирование исследования\nВ. Формулирование выводов\nГ. Проведение исследования по намеченному плану\nВарианты ответа\n1 - Б, Г, А, В\n2 - А, Б, В, Г\n3 - В, А, Г, Б\n4 - Г, В, Б, А",
    "Кто является Президентом Российской академии наук?\nВарианты ответа\n1 - Красников Г.Я.\n2 - Фальков В.Н.\n3 - Гумерова Л.С.\n4 - Фурсенко А.А.",
    "Какой проект был запущен в рамках Десятилетия науки и технологий для поддержки молодых ученых?\nВарианты ответа\n1 - Научные стартапы\n2 - Молодежный научный фонд\n3 - Ученые-эксперты\n4 - Научные лаборатории",
    "Какой проект был реализован для поддержки стартапов в области высоких технологий?\nВарианты ответа\n1 - Технопарк «Сколково»\n2 - Научный центр РАН\n3 - Институт проблем передачи информации\n4 - Фонд новых технологий",
    "Когда прошел Первый Конгресс молодых учёных:\nВарианты ответа\n1 - Ноябрь 2021 год\n2 - Декабрь 2021 года\n3 - Октябрь 2021 года\n4 - Август 2022 года"
]
answers_choices_test1 = [
    "ученый",
    "опыт",
    "волонтерство",
        "конгресс",
    [
        "наука", "сириус", "конгресс"
    ]
]
callbacks_test1 = [
    ["test1_uncorrect", "test1_uncorrect", "test1_uncorrect", "test1_correct"],
    ["test1_correct", "test1_uncorrect", "test1_uncorrect", "test1_uncorrect"],
    ["test1_uncorrect", "test1_uncorrect", "test1_uncorrect", "test1_correct"],
    ["test1_correct", "test1_uncorrect", "test1_uncorrect", "test1_uncorrect"],
    ["test1_correct", "test1_uncorrect", "test1_uncorrect", "test1_uncorrect"],
    ["test1_uncorrect", "test1_correct", "test1_uncorrect", "test1_uncorrect"],
    ["test1_uncorrect", "test1_uncorrect", "test1_correct", "test1_uncorrect"],
    ["test1_correct", "test1_uncorrect", "test1_uncorrect", "test1_uncorrect"],
    ["test1_correct", "test1_uncorrect", "test1_uncorrect", "test1_uncorrect"],
    ["test1_uncorrect", "test1_uncorrect", "test1_uncorrect", "test1_correct"],
    ["test1_uncorrect", "test1_uncorrect", "test1_uncorrect", "test1_correct"],
    ["test1_uncorrect", "test1_uncorrect", "test1_correct", "test1_uncorrect"],
    ["test1_uncorrect", "test1_correct", "test1_uncorrect", "test1_uncorrect"],
    ["test1_uncorrect", "test1_uncorrect", "test1_correct", "test1_uncorrect"],
    ["test1_uncorrect", "test1_correct", "test1_uncorrect", "test1_uncorrect"],

]

answers_choices_test2 = [
    ["корсовет", "инициативы", "волонтерство"],
]
callbacks_test2 = [
    ["test2_uncorrect", "test2_uncorrect", "test2_uncorrect", "test2_correct"],
    ["test2_uncorrect", "test2_correct", "test2_uncorrect", "test2_uncorrect"],
    ["test2_uncorrect", "test2_uncorrect", "test2_correct", "test2_uncorrect"],
    ["test2_correct", "test2_uncorrect", "test2_uncorrect", "test2_uncorrect"],
    ["test2_uncorrect", "test2_correct", "test2_uncorrect", "test2_uncorrect"],
    ["test2_uncorrect", "test2_uncorrect", "test2_uncorrect", "test2_correct"],
    ["test2_correct", "test2_uncorrect", "test2_uncorrect", "test2_uncorrect"],
    ["test2_uncorrect", "test2_uncorrect", "test2_correct", "test2_uncorrect"],
    ["test2_uncorrect", "test2_correct", "test2_uncorrect", "test2_uncorrect"],
    ["test2_correct", "test2_uncorrect", "test2_uncorrect", "test2_uncorrect"],
    ["test2_uncorrect", "test2_uncorrect", "test2_correct", "test2_uncorrect"],
    ["test2_uncorrect", "test2_correct", "test2_uncorrect", "test2_uncorrect"],
    ["test2_correct", "test2_uncorrect", "test2_uncorrect", "test2_uncorrect"],
    ["test2_uncorrect", "test2_uncorrect", "test2_correct", "test2_uncorrect"],
    ["test2_correct", "test2_uncorrect", "test2_uncorrect", "test2_uncorrect"],
    ["test2_uncorrect", "test2_correct", "test2_uncorrect", "test2_uncorrect"],
    ["test2_correct", "test2_uncorrect", "test2_uncorrect", "test2_uncorrect"],
    ["test2_correct", "test2_uncorrect", "test2_uncorrect", "test2_uncorrect"],
    ["test2_uncorrect", "test2_uncorrect", "test2_uncorrect", "test2_correct"],
    ["test2_uncorrect", "test2_correct", "test2_uncorrect", "test2_uncorrect"]
]



